import streamlit as st
import nltk
nltk.download('punkt')
nltk.download('punkt_tab')
from utilities.summarization import RNNSummary, KMeansSummary

# tabs
supervised_tab, unsupervised_tab = st.tabs(["🤖 By Supervised", "🦸 By Unsupervised"])
sample_title = "သမိုင်းတစ်လျှောက် စံချိန်တင် မြင့်တက်ခဲ့သော ငွေကြေး ဖောင်းပွမှုနှုန်း"
sample_body = "တစ်နှစ်အတွင်း သယ်ယူပို့ဆောင်ရေးအုပ်စုကုန်ကျစရိတ် ၅၆ ရာခိုင်နှုန်းကျော်၊ အစားအစာအုပ်စုကုန်စျေးနှုန်း ၁၇ ရာခိုင် နှုန်းကျော် မြင့်တက်ခဲ့ကြောင်း ဗဟိုစာရင်း အင်းအဖွဲ့က ထုတ်ပြန်သည့် စားသုံးသူစျေးဆ နှုန်းနှင့် ငွေကြေးဖောင်းပွမှုနှုန်းအခြေအနေ အရ သိရသည်။ ၂၀၂၁ခုနှစ် ဇွန်တွင် အစားအစာအုပ်စု ၁၈၂ ဒသမ၃၉၊ အစားအစာမဟုတ်သော အုပ် စု ၁၅၂ဒသမ ၈၈၊သယ်ယူပို့ ဆောင်ရေး အုပ်စု ၁၂၅ ဒသမ ၀၆ ရှိခဲ့သည်။၂၀၂၂ ခုနှစ် ဇွန်တွင် အစားအစာအုပ်စု ၂၁၃ ဒသမ ၄၈၊ အစားအစာမဟုတ်သော အုပ် စု ၁၈၈၄ ဒသမ ၆၉၊ သယ်ယူပို့ဆောင်ရေး အုပ်စု ၁၉၂ ဒသမ ၈၄ ရှိခဲ့သည်။ ၂၀၂၂ ခုနှစ် ဇွန်လအတွက် ထုတ်ပြန် သော တစ်နိုင်ငံလုံး၏စားသုံးသူစျေးဆနှုန်း နှင့် ငွေကြေးဖောင်းပွမှုစိစစ်ချက်အရ ၂၀၂၁ ခုနှစ် ဇွန်လထက် အစားအစာအုပ်စု ၁၇ ဒသမ  ၀၄ ရာခိုင်နှုန်း၊ အစားအစာမဟုတ်သော အုပ် စု ၂၃ ဒသမ ၄၂ ရာခိုင်နှုန်း၊ သယ်ယူပို့ ဆောင်ရေး အုပ်စု ၅၆ ဒသမ ၅၉  ရာခိုင်နှုန်း မြင့်တက်ခဲ့သည်။ “ကျွန်မဆိုင်မှာ ဆန်တစ်လုံးလိုချင် လည်း ရောင်းတယ်။ နှစ်လုံးလိုချင်လည်း ရောင်းတယ်။ ဆန်တစ်ပြည်တောင် မဝယ်နိုင်တဲ့သူတွေက ထမင်းတစ်နပ်စားခါနီးမှ နှစ်လုံးဝယ်၊ သုံးလုံးဝယ် လာဝယ်ကြတာပါ။ တစ်ခါတလေဆို  ဆန် နို့ဆီဘူးနှစ်လုံး၊ သုံးလုံး တောင် မဝယ်နိုင်ကြတဲ့အခါ တစ်လုံးပဲ လာ ဝယ်ကြတာလည်းရှိတယ်။ ခုနောက်ပိုင်းပိုဆိုး လာတာက ဆီကို ၂၀၀ ဖိုးရောင်းပေးပါဆိုပြီး လာဝယ်ကြတာပဲ။ ဟိုအရင်နှစ်တွေက ဆီ စျေးနဲ့ ၂၀၀၊ ၃၀၀ ဖိုး ကျွန်မရောင်းပေးခဲ့တယ်။ အခု ဆီ၁၀ သား ၁၀၀၀ စျေးနဲ့ ၂ဝဝဖိုး၊ ၃၀၀ ဖိုး မရောင်းပေးနိုင်တော့ဘူး။ ပေါက်စီတစ် လုံးတောင် ၁၀၀၀၊ မုန့်ဟင်းခါးအလွတ် ရပ် ကွက်ထဲမှာ ၇၀၀၊ လက်ဖက်ရည်ဆိုင်တွေမှာ ဆိုရင် ၁၀၀၀၊  ရွှေဘိုပေါ်ဆန်းတစ်အိတ်တစ် သိန်းလေ။ မနှစ် ကစျေးနဲ့ ဒီနှစ်စျေး နှစ်ဆပဲ။အကုန် တက်စျေးတွေချည်းပဲ” ဟု သင်္ဃန်း ကျွန်းမြို့ နယ်တွင် ကုန်စုံဆိုင်ဖွင့်လှစ်ရောင်း ချနေသူတစ်ဦးက ပြောကြားခဲ့သည်။ ၂၀၂၂ ခုနှစ် ဇွန်တွင် စားသုံးသူစျေးဆနှုန်း (CPI) ၂၀၃ ဒသမ ၁၈ ဖြစ်ပေါ်ခဲ့ပြီး ၂၀၂၁ ခုနှစ် ဇွန်လတွင် ဖြစ်ပေါ်ခဲ့သည့်စားသုံး သူစျေးဆနှုန်းထက် ၁၉ ဒသမ ၄၂ ရာ ခိုင်နှုန်း မြင့်တက်ခဲ့ကြောင်း ဗဟိုစာရင်းအင်း အဖွဲ့က ထုတ်ပြန်သည့် စားသုံးသူစျေးဆနှုန်း နှင့်ငွေ ကြေးဖောင်းပွမှုနှုန်းအခြေအနေအရ သိရ သည်။ ၂၀၁၂ ခုနှစ် အခြေခံနှစ်ဖြင့် တွက်ချက်ထားသော တစ်နိုင်ငံလုံး၏ စားသုံးသူစျေးဆနှုန်းကို လေ့လာပါက ၂၀၁၉ ခုနှစ် မတ်လတွင် ၁၅၀ ဒသမ ၁၃ ရှိခဲ့ရာမှ တဖြည်းဖြည်းပြန် လည်မြင့်တက်ခဲ့ရာ ၂၀၁၉ ခုနှစ် ဒီဇင်ဘာ တွင် ၁၆၁ ဒသမ ၇၂ ဖြစ်ပေါ်ခဲ့သည်။ ၂၀၂၀ ပြည့်နှစ် ဇန်နဝါရီတွင် ၁၆၁ ဒသမ ၃၃ရှိခဲ့သည်။ ဇွန်လတွင် ၁၆၀ ဒသမ ၉၈  ရှိခဲ့ပြီး ဒီဇင်ဘာတွင် ၁၆၂ ဒသမ ၉၄   ဖြစ်ပေါ်ခဲ့သည်။ ၂၀၂၁ ခုနှစ် ဇန်နဝါရီတွင် ၁၆၂ ဒသမ ၅၃ ဖြစ်ပေါ်ခဲ့သည်။ ၂၀၂၁ ခုနှစ် ဇွန်လတွင် ၁၇၀ ဒသမ ၁၃၊ ဇူလိုင်တွင် ၁၇၁ ဒသမ ၆၃၊သြဂုတ်တွင်    ၁၇၂ ဒသမ ၉၂၊ စက်တင်ဘာတွင် ၁၇၄ ဒသမ ၉၇၊ အောက်တိုဘာတွင် ၁၇၉ ဒသမ ၂၀၊ နိုဝင်ဘာတွင် ၁၈၁ ဒသမ ၇၂၊ ဒီဇင်ဘာ တွင် ၁၈၃ ဒသမ ၅၁အထိ မြင့် တက်ခဲ့သည်။ ၂၀၂၂ ခုနှစ် ဇန်နဝါရီတွင်  ၁၈၄ ဒသမ ၈၉၊ ဖေဖော် ၀ါရီတွင် တစ်နိုင်ငံလုံးအတွက် စား သုံးသူစျေးဆနှုန်းမှာ ၁၈၆ ဒသမ ၈၂ ၊ မတ်လ တွင် ၁၉၂ ဒသမ ၇၁ ၊ ဧပြီတွင် ၁၉၆ ဒသမ ၀၁၊ မေလတွင် ၁၉၉ ဒသမ ၃၁၊ ဇွန်လတွင် ၂၀၃ ဒသမ ၁၈ အထိ ရှိလာခဲ့သည်။ ၂၀၁၂ ခုနှစ် အခြေခံနှစ်ဖြင့် ၂၀၁၈ ခုနှစ် ဇွန်မှ ၂၀၂၀ ပြည့်နှစ် ဇွန်လအထိ တစ် နှစ်တာအတွင်း ဖြစ်ပေါ်ခဲ့သော တစ်နိုင်ငံလုံး ၏ စားသုံးသူစျေးဆနှုန်းကို လေ့လာပါက ၂၀၁၉ ခုနှစ် မတ်လတွင် ၁၅၀ ဒသမ ၁၃ ရှိခဲ့ရာမှ တဖြည်းဖြည်းပြန်လည်မြင့်တက်ခဲ့ရာ ၂၀၁၉ ခုနှစ် ဒီဇင်ဘာတွင် ၁၆၁ ဒသမ ၇၂ ဖြစ်ပေါ် ခဲ့သည်။ သို့ရာတွင် ၂၀၂၀ ပြည့်နှစ် ဇန်နဝါ ရီမှစ၍အစားအစာ အုပ်စုစျေးနှုန်း များ တဖြည်းဖြည်းကျဆင်းလာခဲ့ရာ မေလ တွင် ၁၆၀ ဒသမ ၁၂ ဖြစ်ပေါ်ခဲ့သည်။ သို့ သော် ယခု ၂၀၂၀ ပြည့်နှစ် ဇွန်လတွင် ၁၆၀ ဒသမ ၉၈ ဖြစ်ပေါ်ခဲ့သဖြင့် ယခင်လနှင့် နှိုင်း ယှဉ် ပါက အနည်းငယ်ပြန်လည်မြင့်တက်ခဲ့ သည်။  တစ်နိုင်ငံလုံး၏ စားသုံးသူစျေးဆနှုန်း တွက်ချက်ရန်အတွက် အစားအစာအုပ်စု၊ ဆေးလိပ်နှင့် အဖျော်ယမကာအုပ်စု၊ အဝတ်အထည်၊ အိမ်လခနှင့် အိမ်ပြင်ခအုပ်စု၊ အိမ်အသုံးအဆောင်ပစ္စည်းနှင့် ပြုပြင်ထိန်းသိမ်း စရိတ်အုပ်စု၊ ကျန်းမာရေးအုပ်စု၊ သယ်ယူပို့ ဆောင်ရေးအုပ်စု၊ ဆက်သွယ်ရေးအုပ်စု၊ အပန်းဖြေခြင်းနှင့် ယဉ်ကျေးမှုအုပ်စု၊ ပညာ ရေးအုပ်စု၊ ပြင်ပအစားအသောက်အုပ်စု၊ အထွေထွေကုန်ပစ္စည်းအုပ်စု၊ အစားအစာ မဟုတ်သောအုပ်စု စသည်ဖြင့် အုပ်စုများခွဲ ၍ ကောက်ခံခဲ့ခြင်းဖြစ်ကြောင်း သိရသည်။ တစ်နိုင်ငံလုံးအတွက် စားသုံးသူစျေးဆ နှုန်းနှင့် ငွေကြေးဖောင်းပွမှုနှုန်းကို ပြောင်းလဲတွက်ချက် တင်ပြနိုင်ရန် ၂၀၁၂ ခုနှစ် နိုဝင်ဘာတွင် ဗဟိုစာရင်းအင်းအဖွဲ့သည် အိမ်ထောင်စုဝင်ငွေနှင့် စားသုံးမှုစစ်တမ်းကို မြို့ နယ်ပေါင်း ၈၂ မြို့နယ်တွင် နမူနာအိမ်ထောင် စုပေါင်း ၃၂၆၆၉ ကို စစ်တမ်းကောက်ယူခဲ့ ကြောင်း သိရသည်။ ၂၀၁၂ ခုနှစ် အခြေခံနှစ် ဖြင့် စစ်တမ်းကောက်ယူရာတွင် ကုန်ပစ္စည်း အမျိုးအစားများမှာ အများသုံးစွဲသည့် ကုန် ပစ္စည်းနှင့် ဝန်ဆောင်မှုအမျိုးအစားပေါင်း ၄၃၈ မျိုးပါဝင်ကြောင်း သိရသည်။ စားသုံးသူ စျေးဆနှုန်းတွက်ချက်ရန်အတွက် အစားအ စာအုပ်စုတွင် ကုန်ပစ္စည်း ၁၀၈ မျိုးနှင့် အစား အစာမဟုတ်သော အုပ်စုတွင် ကုန်ပစ္စည်း အမျိုးအစား ၁၆၆ မျိုးရွေးချယ်ခဲ့ပြီး စုစုပေါင်း  ၂၇၄ မျိုးသို့ တိုးချဲ့ကောက်ယူတွက်ချက်ခဲ့ ကြောင်း ဗဟိုစာရင်းအင်းအဖွဲ့၏ ထုတ်ပြန် ထားမှုအရ သိရသည်။ ၂၀၂၂ ခုနှစ် ဇွန်လတွင် မြန်မာနိုင်ငံ၏ ပျမ်းမျှငွေကြေးဖောင်းပွမှုနှုန်း ၁၂ ဒသမ ၉၃ ရာခိုင်နှုန်းအထိ  မြင့်တက်ခဲ့ပြီး သမိုင်းတစ် လျှောက် စံချိန်တင်မြင့်တက်ခဲ့သည့်ငွေကြေး ဖောင်းပွမှုမှုန်းဖြစ်လာကြောင်း ဗဟိုစာရင်း အင်းအဖွဲ့က ထုတ်ပြန်သည့်အချက်အလက် များအရ သိရသည်။ ဇွန်လတွင် မြန်မာနိုင်ငံ၏ ပျမ်းမျှငွေ ကြေးဖောင်းပွမှုနှုန်း (Annual Rate of Inflation) မှာ ၁၂ ဒသမ ၉၃  ရာခိုင်နှုန်းဖြစ် ပြီး နှစ်အလိုက်ငွေကြေးဖောင်းပွမှုနှုန်း (Year on Year Inflation) မှာ ၁၉ ဒသမ ၄၂ ရာခိုင်နှုန်းဖြစ်သည်။ ၂၀၁၂ ခုနှစ် အခြေခံနှစ်ဖြင့် တွက်ချက် ထားသော စားသုံးသူစျေးဆနှုန်းနှင့် ငွေကြေး ဖောင်းပွမှုနှုန်းအခြေအနေအရ ၂၀၁၉ ခုနှစ် ဇန်နဝါရီတွင် ၆ ဒသမ ၉၄ ရာခိုင်နှုန်းရှိခဲ့ရာမှ ဖေဖော်ဝါရီတွင် ၇ ဒသမ ၀၇ ရာခိုင်နှုန်း၊ မတ် တွင် ၇ ဒသမ ၂၈ ရာခိုင်နှုန်း၊ ဧပြီတွင် ၇ ဒသမ ၅၁ ရာခိုင်နှုန်း၊ မေလတွင် ၇ ဒသမ ၈၂ ရာ ခိုင်နှုန်း ၊ ဇွန်လတွင် ၈ ဒသမ ၀၈ ရာခိုင်နှုန်း စသည်ဖြင့် ပျမ်းမျှငွေကြေးဖောင်းပွမှုနှုန်း ဆက်တိုက်မြင့်တက်ခဲ့ပြီး ဒီဇင်ဘာတွင် ၈ ဒသမ ၈၁ ရာခိုင် နှုန်းအထိ မြင့်တက်ခဲ့သည်။ ၂၀၂၀ ပြည့်နှစ် ဇန်နဝါရီတွင် ပျမ်းမျှငွေ ကြေးဖောင်းပွမှုနှုန်း ၉ ဒသမ ၀၆ ရာခိုင်နှုန်း၊ ဖေဖော်ဝါရီတွင် ၉ ဒသမ ၂၀ ရာခိုင်နှုန်း၊မတ် လတွင် ၉ ဒသမ ၁၀ ရာခိုင်နှုန်း အ ထိဆက် လက် မြင့်တက်ခဲ့သော်လည်း ဧပြီတွင် ၈ ဒသမ ၈၀ ရာခိုင်နှုန်း၊ မေလတွင် ၈ ဒသမ ၃၅ ရာခိုင် နှုန်းအထိ အနည်းငယ်ပြန်လည်ကျဆင်းခဲ့ သည်။ ယင်းနောက် ငွေကြေးဖောင်းပွမှုနှုန်း ဆက်လက်ကျဆင်းခဲ့ပြီး ၂၀၂၀ ပြည့်နှစ် ဒီဇင် ဘာတွင် ၃ ဒသမ ၈၇ ရာခိုင်နှုန်းအထိရှိလာခဲ့ သည်။ ကမ္ဘာ့ဘဏ်၏ထုတ်ပြန်ချက်အရ ၂၀၁၇-၂၀၁၉ ခုနှစ်ကာလအတွင်း ပျမ်းမျှငွေ ကြေးဖောင်းပွမှုနှုန်းသည် ၆ ဒသမ ၄ ရာခိုင် နှုန်းရှိခဲ့ပြီး  ဓာတ်အားခနှင့် စားသောက်ကုန် စျေးနှုန်းများ ကျဆင်းသည့်အတွက် ၂၀၂၀ ပြည့်နှစ်ကုန်တွင် ၅ ဒသမ ၂ ရာခိုင်နှုန်းသို့ ရောက်ရှိခဲ့သည်။ ၂၀၂၁ ခုနှစ် ဇန်နဝါရီတွင် သုည ဒသမ ၇ ရာခိုင်နှုန်း ထပ်မံလျော့ နည်းခဲ့သော်လည်း စားသောက်ကုန်နှင့် လောင်စာဆီစျေးနှုန်း များ မြင့်တက်လာသည့်အတွက် ၂၀၂၁ ခုနှစ် စက် တင်ဘာလအထိ တစ်နှစ်တာ အတွင်း ၇ ဒသမ ၃ ရာခိုင်နှုန်းသို့ ရောက်ရှိလာသည်။ သယ်ယူပို့ဆောင်ရေးစရိတ်များ သိသာ စွာ မြင့်တက်လာခြင်းကြောင့်  စားသောက် ကုန်စည်များ မပါဝင်ဘဲ တွက်ချက်ထားသည့် ငွေ ကြေးဖောင်းပွမှုနှုန်းသည် ဇန်နဝါရီ တွင် သုည  ဒသမ ၆ ရာခိုင်နှုန်းရှိခဲ့ရာ မှ  ဒီဇင်ဘာ တွင် ၉ ဒသမ ၈ ရာ ခိုင်နှုန်းသို့ ရောက်ရှိခဲ့ သည်။ သို့သော် စားသောက်ကုန်နှင့် လောင်စာ ဆီစျေးနှုန်းများ မြင့်တက်လာသည့်အတွက် ၂၀၂၂ ခုနှစ် စက်တင်ဘာအထိ တစ်နှစ်အ တွင်း ငွေ ကြေးဖောင်းပွမှုနှုန်း ၈ ဒသမ ၇ ရာ ခိုင်နှုန်းသို့ ရောက်ရှိလာမည်ဟု ကမ္ဘာ့ဘဏ် က ခန့်မှန်းခဲ့သည်။ လအလိုက် ဖြစ်ပေါ်ခဲ့သော မြန်မာနိုင် ငံ၏ ပျမ်းမျှငွေကြေးဖောင်းပွမှုနှုန်းမှာ ၂၀၂၁ ခုနှစ် ဖေဖော်ဝါရီတွင် ၂ ဒသမ ၆၁ ရာခိုင်နှုန်း၊ မတ်လတွင် ၂ ဒသမ ၂၈ ရာခိုင်နှုန်း၊ ဧပြီတွင် ၂ ဒသမ ၁ရရာခိုင်နှုန်း၊ မေလတွင် ၂ ဒသမ ၂၇ ရာခိုင်နှုန်း၊ ဇွန်လတွင် ၂ ဒသမ ၄၀ ရာခိုင် နှုန်း၊ ဇူလိုင်တွင် ၂ ဒသမ ၈၀ ရာခိုင်နှုန်း၊ သြ ဂုတ်တွင် ၃ ဒသမ ၂ဝရာခိုင်နှုန်း၊စက်တင်ဘာ တွင် ၃ဒသမ ၆၄ ရာခိုင်နှုန်း၊ အောက်တိုဘာ တွင် ၄ ဒသမ ၃၄ ရာခိုင်နှုန်း၊ နိုဝင်ဘာတွင် ၅ ဒသမ ၂၃ ရာခိုင်နှုန်း၊ ဒီဇင်ဘာတွင် ၆ ဒသမ ၂၂ ရာခိုင်နှုန်းရှိခဲ့သည်။ ၂၀၂၁-၂၀၂၂ ဘဏ္ဍာနှစ် ပထမသုံးလ ပတ်ကာလအတွင်း မြန်မာနိုင်ငံ၏ ပျမ်းမျှ ငွေကြေးဖောင်းပွမှုနှုန်းမှာ ၁၁ ဒသမ ၃၉  ရာ ခိုင်နှုန်းဖြစ်ပြီး နှစ်အလိုက်ငွေကြေးဖောင်းပွမှု နှုန်းမှာ ၁၁ ဒသမ ၃၉ ရာခိုင်နှုန်းဖြစ်သည်။ ၂၀၂၁-၂၀၂၂ ဘဏ္ဍာနှစ် ဒုတိယသုံး လပတ်ကာလအတွင်း မြန်မာနိုင်ငံ၏ ပျမ်းမျှ ငွေကြေးဖောင်းပွမှုနှုန်း (Annual Rate of Inflation) မှာ ၁၅ ဒသမ ၀၅  ရာခိုင်နှုန်းဖြစ် ပြီး နှစ်အလိုက်ငွေကြေးဖောင်းပွမှုနှုန်း(Year on Year Inflation) မှာ ၁၅ ဒသမ ၀၆ ရာခိုင် နှုန်းဖြစ်သည်။ ၂၀၂၁-၂၀၂၂ ဘဏ္ဍာနှစ် ပထမသုံး လပတ်ကာလအတွင်း မြန်မာနိုင်ငံ၏ ပျမ်းမျှ ငွေကြေးဖောင်းပွမှုနှုန်းမှာ ၁၁ ဒသမ ၃၉  ရာ ခိုင်နှုန်းဖြစ် ပြီး နှစ်အလိုက်ငွေကြေးဖောင်းပွ မှုနှုန်းမှာ ၁၁ ဒသမ ၃၉ ရာခိုင် နှုန်းဖြစ်သည်။ ၂၀၂၀-၂၀၂၁ ဘဏ္ဍာနှစ် အောက်တို ဘာ ၁ ရက်မှ စက်တင်ဘာ ၃၀ ရက်အထိကာ လအတွင်း ဖြစ်ပေါ်ခဲ့သည့် ပျမ်းမျှငွေကြေး ဖောင်းပွမှုနှုန်းအနေဖြင့် ၂၀၂၀ ပြည့် နှစ် အောက်တိုဘာ ၁ ရက်မှ ဒီဇင်ဘာ ၃၁ ရက်အ ထိ ပထမသုံးလပတ်အတွင်း ပျမ်းမျှ ငွေကြေး ဖောင်းပွမှုနှုန်း  ၁ ဒသမ ၀၈ ရာခိုင်နှုန်း၊ ၂၀၂၁ ခုနှစ် ဇန်နဝါရီ ၁ ရက်မှ မတ် ၃၁ ရက်အထိ ဒုတိယသုံးလပတ်အတွင်း ၁ ဒသမ ၆၃ ရာခိုင် နှုန်း၊ ဧပြီ ၁ ရက်မှ ဇွန် ၃၀ ရက်အထိ တတိယ သုံးလပတ်အတွင်း ၅ ဒသမ ၀၂ ရာခိုင်နှုန်း နှင့် ဇူလိုင် ၁ ရက်မှ စက်တင် ဘာ ၃၀ ရက်အ ထိ  စတုတ္ထသုံးလပတ်အတွင်း ၆ ဒသမ ၈၃ ရာခိုင်နှုန်းရှိခဲ့သည်။ သို့သော် ၂၀၂၂ ခုနှစ် ဇန်နဝါရီတွင် ပျမ်း မျှငွေကြေးဖောင်းပွမှုနှုန်း ၇ ဒသမ ၃၀ ရာခိုင်နှုန်းအထိ မြင့်တက်လာကာ ဖေဖော် ၀ါရီတွင် ၈ ဒသမ ၃၅ ရာခိုင်နှုန်း၊ မတ်လတွင် ၉ ဒသမ ၅၇ ရာခိုင်နှုန်း၊ဧပြီတွင် ၁၀ ဒသမ ၇၂ ရာ ခိုင် နှုန်း၊ မေလတွင် ၁၁ ဒသမ ၇၉ ရာခိုင်နှုန်း၊ ဇွန်လတွင် ၁၂ ဒသမ ၉၃ ရာခိုင် နှုန်းအထိ  ဆက်လက်မြင့်တက်ကာ သမိုင်း တစ်လျှောက် စံချိန်တင်ပျမ်းမျှငွေကြေးဖောင်း ပွမှုနှုန်းသို့ ရောက်ရှိလာခဲ့သည်။ ငွေကြေးဖောင်းပွမှုသည် ကာလအတန် ကြာ အထွေထွေစျေးနှုန်း  မြင့်တက်လာခြင်း ဖြစ်ပြီး လူအများစားသုံးသည့် အခြေခံကုန် စည်များ၏ စျေးနှုန်းများ ဆက်တိုက်မြင့်တက် လာခြင်းကို ငွေကြေးဖောင်းပွမှုရှိသည်ဟု ဆို လိုခြင်းဖြစ်သည်။ အချိန်အတိုင်းအတာတစ်ခု၌ စီးပွား ရေးရပ်ဝန်းအတွင်း ကုန်ပစ္စည်းများနှင့် ဝန် ဆောင်မှုများ၏ အထွေထွေစျေးနှုန်း မြင့် တက်လာသည့်အခါ တူညီသော ငွေကြေးယူ နစ်ဖြစ်သော်လည်း ပိုမိုနည်းပါးသော ကုန် ပစ္စည်းနှင့် ဝန်ဆောင်မှုတို့ကိုသာ ဝယ်ယူနိုင် မည်ဖြစ်သည်။ တစ်နည်းအားဖြင့် ငွေကြေးဖောင်းပွမှု သည် ငွေကြေး၏ဝယ်ယူနိုင်စွမ်း၊ ငွေကြေး ယူနစ်၏တန်ဖိုးကို လျော့ကျစေခြင်းဖြစ်သည်။ ငွေကြေးဖောင်းပွမှုကို တိုင်းတာခြင်း ကို ငွေကြေးဖောင်းပွမှုနှုန်း Inflation Rate  ဟု ခေါ်ဆိုပြီး အထွေထွေစျေးနှုန်း အညွှန်းတစ်ရပ်ဖြင့် နှစ်စဉ် ရာခိုင်နှုန်းအ ပြောင်းအလဲကို ဖော်ပြကာ အဆိုပါအညွှန်း ကို စားသုံးသူစျေးဆနှုန်း CPI- Consume Price Index ဟု ခေါ်ဆိုခြင်းဖြစ်သည်။ ငွေကြေးဖောင်းပွမှုနှုန်း ကာလကြာ ရှည် မြင့်မားနေခြင်းသည် ငွေကြေးရိုက်ထုတ် မှုများပြားမှု၊ နိုင်ငံခြားငွေလဲနှုန်းမြင့်တက်မှု၊ နိုင်ငံ့ငွေတန်ဖိုးကျဆင်းမှု၊ ဝယ်လိုအား သို့ မဟုတ် ရောင်းလိုအား အဆမတန်မြင့်တက်မှု၊ အနိမ့်ဆုံးလုပ်ခလစာနှုန်း၊ စားနပ်ရိက္ခာစျေး နှုန်းများမြင့်တက်မှု၊ ရေနံစျေး၊ အခြေခံစျေး နှုန်းများမြင့်တက်မှု၊ သဘာဝဘေးအန္တရာယ် ကျရောက်မှု၊ အရင်းအနှီးစျေးကွက်၊ စတော့ စျေးကွက်များ ကမောက်ကမ ဖြစ်ပေါ်မှု၊ ဘဏ်တိုးနှုန်းပြောင်းလဲမှု၊ အစိုးရ အသုံးစရိတ် များပြားမှု၊ ကောလာဟလသတင်းများ ဖြစ် ပေါ်မှု၊ ပြည်သူများ၏ နိုင်ငံ့စီးပွားရေးအပေါ် ယုံကြည်စိတ်ပျောက်ဆုံးမှုစသည့်အကြောင်း အရာများနှင့် သက်ဆိုင်နေကြောင်း စီးပွား ရေးပညာရှင်များက ပြောကြားထားသည်။ ငွေကြေးဖောင်းပွမှုနှုန်းသည် နိုင်ငံတစ်  နိုင်ငံ၏ စီးပွားရေးအခြေအနေကို အကဲဖြတ် ရာတွင် အဓိကအခန်းကဏ္ဍမှ ပါဝင်သည်။ စီးပွားရေးဖွံ့ဖြိုးတိုးတက်မှုရှိစေရန် ထိုက် သင့်သော ငွေကြေးဖောင်းပွမှုရှိရန် လိုအပ် သကဲ့သို့ လွန်ကဲသော ငွေကြေးဖောင်းပွမှု ကြောင့် နိုင်ငံများ ကာလကြာရှည်မတည် မငြိမ်ဖြစ်စေနိုင်ကြောင်းလည်း ထောက်ပြခဲ့ ကြသည်။ ရှိသင့်ရှိထိုက်သည့် ငွေကြေးဖောင်းပွမှု နှုန်းထက် ကျော်လွန်ပါက ပြည်သူများ၏ နေ့ စဉ်စားဝတ်နေရေး ဖြည့်ဆည်းနိုင်စွမ်းကို ဆိုးရွားစွာ ထိခိုက်စေသည့်အတွက် ဗဟိုဘဏ် နှင့် အစိုးရအနေဖြင့် သတိကြီးစွာထား၍ ထိန်းကျောင်းရမည်ဖြစ်ကြောင်း စီးပွားရေး လုပ်ငန်းရှင်များက သုံးသပ်ပြောကြားခဲ့ သည်။ ၂၀၂၂ ခုနှစ် အစကတည်းကပင် မြန် မာ့စီးပွားရေးသည် သိသိသာသာ ဆိုးရွား သော ပြည်တွင်းပြည်ပအကျပ်အတည်းနှင့် ဆက်တိုက်ဆိုသလို ရင်ဆိုင်နေခဲ့ရသည်။ ယူကရိန်းစစ်ပွဲကြောင့် လောင်စာဆီ နှင့် ဓာတ်မြေသြဇာစျေးနှုန်းများ မြင့်တက် လာ ခြင်းက ကုန်ပစ္စည်းအမျိုးအစားများစွာနှင့် ဝန်ဆောင်မှုများကို ကျယ်ကျယ်ပြန့်ပြန့် ထိခိုက်စေခဲ့သည်။ နောက်ဆက်တွဲအနေဖြင့် ကုန်ထုတ် လုပ်ငန်းများအားလုံး၏ သွင်းအားအင်အား စုစျေးနှုန်းများ ထိုးတက်သွားစေခဲ့ပြီး ငွေ ကြေးဖောင်းပွမှုကြီးထွားလာကာ အမှန်အိမ် ထောင်စုဝင်ငွေ real household incomeကို များစွာထိခိုက်စေခဲ့သည်ဟု ကမ္ဘာ့ဘဏ် က ဆိုသည်။ ကမ္ဘာ့ဘဏ်၏ မြန်မာ့စီးပွားရေးစောင့် ကြည့်လေ့လာမှုအစီရင်ခံစာ-ဇူလိုင်၊ ၂၀၂၂ အရ  ငွေကြေးဖောင်းပွမှုနှုန်းမှာ ကမ္ဘာ့ကုန် စည်စျေးနှုန်းများ မြင့်မားနေခြင်း၊ ကျပ်ငွေ တန်ဖိုးကျဆင်းခြင်းနှင့် သယ်ယူပို့ဆောင် ရေး အခက်အခဲများကြောင့် ဆက်လက်မြင့် မားနေမည်ဟုခန့်မှန်းပြီး ပျမ်းမျှအားဖြင့် ၂၀၂၂ ဘဏ္ဍာနှစ်တွင် ၁၅ ရာခိုင်နှုန်း (တစ် နှစ်ထက် တစ်နှစ် ငွေကြေးဖောင်းပွမှုနှုန်းမှာ ဒုတိယနှစ်ဝက်တွင် အမြင့်ဆုံးဖြစ်) ရှိနိုင် ကြောင်း ဖော်ပြထားသည်။ငွေကြေးဖောင်းပွမှုကို တိုင်းတာမှုအမျိုး မျိုးရှိပြီး ယေဘုယျအားဖြင့် အထွေထွေစျေး နှုန်းများ ကာလကြာရှည်မြင့်တက်မှု သို့မ ဟုတ် နိုင်ငံတစ်ဝန်း လူနေမှုစရိတ်များ မြင့် တက်မှုဖြစ်သည်။"

# text summarization with the supervised method
with supervised_tab:
    # App title
    st.title("Text Summarization (Supervised)")

    title_input = st.text_input("Enter News Title", key="input_title_supervised")
    need_help = st.checkbox("Need help for the sample title ?", key="help_checkbox_1_title")
    if need_help:
        st.code(sample_title)
    body_input = st.text_area("Enter News Body", key="input_body_supervised")
    need_help = st.checkbox("Need help for the sample body ?", key="help_checkbox_1_body")
    if need_help:
        st.code(sample_body)
    button_supervised = st.button("Summarize", key="button_supervised")

    # line divider
    st.write("***")

    # result placeholder
    result_placeholder = st.empty()
    result_placeholder.text_area("Here is the result", key="output_summary_supervised", disabled=True)

    if button_supervised:
        # summarize
        title = title_input.title()
        body = body_input.title()
        sortedsummary = RNNSummary.summarize(title, body)

        # show the result
        result_placeholder.text_area("Here is the result (Best 4 sentences)", sortedsummary, disabled=True)

# text summarization with the unsupervised method
with unsupervised_tab:
    # App title
    st.title("Text Summarization (Unsupervised)")

    title_input = st.text_input("Enter News Title", key="input_title_unsupervised")
    need_help = st.checkbox("Need help for the sample title ?", key="help_checkbox_2_title")
    if need_help:
        st.code(sample_title)
    body_input = st.text_area("Enter News Body", key="input_body_unsupervised")
    need_help = st.checkbox("Need help for the sample body ?", key="help_checkbox_2_body")
    if need_help:
        st.code(sample_body)
    button_unsupervised = st.button("Summarize", key="button_unsupervised")

    # line divider
    st.write("***")

    # result cluster placeholder
    cluster_placeholder = st.empty()
    cluster_placeholder.selectbox("Choose Cluster", ["Overall"], disabled=True)

    # result placeholder
    result_placeholder = st.empty()
    result_placeholder.text_area("Here is the result", key="output_summary_unsupervised", disabled=True)

    if button_unsupervised:
        # summarize
        title = title_input.title()
        body = body_input.title()
        sortedsummary, cluster_list = KMeansSummary.summarize(title, body)

        # show the result
        # res = cluster_placeholder.selectbox("Choose Cluster", ["Overall", "Cluster 1", "Cluster 2", "Cluster 3", "Cluster 4"])
        result_placeholder.text_area("Here is the result (Best 4 sentences)", sortedsummary, disabled=True)

